app/controllers/albums_controller.rb

INSERT INTO "albums" ("name", "created_at", "updated_at", "user_id") VALUES('test', '2010-05-25 18:17:51', '2010-05-25 18:17:51', 1)
---
  def create
    return unless require_user
    if params[:album_type].nil?
      render :text => "Error No Album Type Supplied. Please Choose Album Type.", :status=>500 and return
    end
    @album  = params[:album_type].constantize.new(:name => Album::DEFAULT_NAME)
    @album.user = current_user
    unless @album.save

SELECT * FROM "photos" WHERE ("photos".album_id = 1) ORDER BY created_at DESC LIMIT 30 OFFSET 0
---
  def set_latest_cover
    return unless require_any_user && require_album #&& require_album_admin_role #TODO: need to fix this, user is blank here

    @album.cover = @album.photos.last