app/controllers/contacts_controller.rb

  def index
    @contacts = current_user.contacts

    response = []
    @contacts.each do |contact|
---
SELECT * FROM "contacts"