app/controllers/shares_controller.rb

                        :share_type =>  Share::TYPE_VIEWER_INVITE,
                        :message    =>  params[:message])

    unless @share.save
---
INSERT INTO "shares" ("email_subject", "created_at", "album_id", "updated_at", "twitter_message", "facebook_message", "user_id", "email_message") VALUES('test', '2010-05-26 14:50:25', 0, '2010-05-26 14:50:25', '', '', 0, 'test')