app/controllers/users_controller.rb

  def create
      # check username if in magic format
      user_info = params[:user]
      checked_user_name = check_reserved_username(user_info)
      if checked_user_name.nil?
        @new_user = User.new()
        @new_user.set_single_error(:username, "You attempted to use a reserved user name without the proper key." )
        render :action => :new and return
      end

      #Check if user is an automatic user ( a contributor that has never logged in but has sent photos )
      @new_user = User.find_by_email( params[:user][:email])
---
SELECT "users".id FROM "users" WHERE (LOWER("users"."email") = 'jeremyhermann@gmail.com') LIMIT 1


      if @new_user.active
        #Save active user
        if @new_user.save
---
INSERT INTO "users" ("name", "encrypted_password", "salt", "created_at", "updated_at", "admin", "remember_token", "email") VALUES('jeremy', '7a5ba43244f27e36d0322b0a0f35a0a3ad1c39f2927609148a869c29181d962f', 'eb5a81796867dcdb9e1d74600408250c1859383f53074058aa7c63e12cf07a81', '2010-05-25 18:17:40', '2010-05-25 18:17:40', NULL, NULL, 'jeremyhermann@gmail.com')
UPDATE "users" SET "updated_at" = '2010-05-25 18:17:40', "remember_token" = '0fa94085a8fdcc3a377eebc115359b65a84591389e3c75234bd2e7c3769ed17c' WHERE "id" = 1